#+TITLE: For a Few Monads More

We are going to go through some more monads to get a hold of them. We are going
to use the package mtl for this. It is pretty standard in most Haskell installs

You can check if you have it by the following:
#+begin_src bash
ghc-pkg list
#+end_src

#+RESULTS:
| /nix/store/r3qwcf425bwzyirhaing00gf8vkd0yih-ghc-8.10.4/lib/ghc-8.10.4/package.conf.d |
| Cabal-3.2.1.0                                                                        |
| array-0.5.4.0                                                                        |
| base-4.14.1.0                                                                        |
| binary-0.8.8.0                                                                       |
| bytestring-0.10.12.0                                                                 |
| containers-0.6.2.1                                                                   |
| deepseq-1.4.4.0                                                                      |
| directory-1.3.6.0                                                                    |
| exceptions-0.10.4                                                                    |
| filepath-1.4.2.1                                                                     |
| (ghc-8.10.4)                                                                         |
| ghc-boot-8.10.4                                                                      |
| ghc-boot-th-8.10.4                                                                   |
| ghc-compact-0.1.0.0                                                                  |
| ghc-heap-8.10.4                                                                      |
| ghc-prim-0.6.1                                                                       |
| ghci-8.10.4                                                                          |
| haskeline-0.8.0.1                                                                    |
| hpc-0.6.1.0                                                                          |
| integer-gmp-1.0.3.0                                                                  |
| libiserv-8.10.4                                                                      |
| mtl-2.2.2                                                                            |
| parsec-3.1.14.0                                                                      |
| pretty-1.1.3.6                                                                       |
| process-1.6.9.0                                                                      |
| rts-1.0                                                                              |
| stm-2.5.0.0                                                                          |
| template-haskell-2.16.0.0                                                            |
| terminfo-0.4.1.4                                                                     |
| text-1.2.4.1                                                                         |
| time-1.9.3                                                                           |
| transformers-0.5.6.2                                                                 |
| unix-2.7.2.2                                                                         |
| xhtml-3000.2.2.1                                                                     |

